In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np
engine = create_engine('mysql+pymysql://root:password@localhost')

In [2]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

# CRUD

In [8]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

              Database
0         email_portal
1                house
2   information_schema
3           leadsource
4     leadsource_test1
5     leadsource_test2
6     leadsource_test3
7     leadsource_test4
8                mysql
9            northwind
10        order_portal
11  performance_schema
12         sarker_fish
13                 sys
14             thakrai
15             trademe

In [10]:
query = """
use house;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [12]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

  Tables_in_house
0            cat2
1            cat3
2            cat4
3            cat5
4            cat6
5            cat8
6            cat9
7            cats
8          people
9            room

In [22]:
query = """
drop table cats;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [24]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

  Tables_in_house
0          people
1            room

In [25]:
query = """
create table cats(
    cat_id int primary key auto_increment,
    name varchar(255),
    age int    
);
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [26]:
query = """
describe cats;
"""
get_query_result(query)

Query executed successfully and returned data.

    Field          Type Null  Key Default           Extra
0  cat_id           int   NO  PRI    None  auto_increment
1    name  varchar(255)  YES         None
2     age           int  YES         None

In [28]:
query = """
insert into cats (name,age)
values 
('tom',3),
('tom2',4),
('tom3',5);
"""
get_query_result(query)

Query executed successfully
Rowcount: 3
Returns Rows: False

In [49]:
query = """
select * from cats;
"""
get_query_result(query)

Query executed successfully and returned data.

Empty DataFrame
Columns: [cat_id, name, age, description, color]
Index: []

In [44]:
query = """
update cats set description='large' where cat_id=1;
"""
get_query_result(query)

Query executed successfully
Rowcount: 1
Returns Rows: False

In [46]:
query = """
delete from cats where cat_id=1;
"""
get_query_result(query)

Query executed successfully
Rowcount: 1
Returns Rows: False

In [48]:
query = """
delete from cats;
"""
get_query_result(query)

Query executed successfully
Rowcount: 2
Returns Rows: False

### Questions:
* suppose you already have a table, add a column which will be choice or enum field
* suppose you already have a table, update a field with enum
* suppose you already have a table, update a column field size
* update a field and give permission to be null

In [31]:
query = """
alter table cats
add
description varchar(255) null;
"""
get_query_result(query)

Query execution failed: (pymysql.err.OperationalError) (1060, "Duplicate column name 'description'")
[SQL:
alter table cats
add
description varchar(255) null;
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [32]:
### suppose you already have a table, add a column which will be choice or enum field

query = """
alter table cats
add
color enum('white','black','brown') null;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [33]:
query = """
describe cats;
"""
get_query_result(query)

Query executed successfully and returned data.

,Field,Type,Null,Key,Default,Extra
0,cat_id,int,NO,PRI,None,auto_increment
1,name,varchar(255),YES,,None,
2,age,int,YES,,None,
3,description,varchar(255),YES,,None,
4,color,"enum('white','black','brown')",YES,,None,

#### * already have a table, update a field with enum

In [35]:
query = """
alter table cats
modify description enum('short','medium','large') null;
"""
get_query_result(query)

Query executed successfully
Rowcount: 3
Returns Rows: False

#### """suppose you already have a table, update an enum field"""

In [37]:
query = """
alter table cats
modify color enum('white','black','brown','gray') null;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [38]:
query = """
desc cats;
"""
get_query_result(query)

Query executed successfully and returned data.

,Field,Type,Null,Key,Default,Extra
0,cat_id,int,NO,PRI,None,auto_increment
1,name,varchar(255),YES,,None,
2,age,int,YES,,None,
3,description,"enum('short','medium','large')",YES,,None,
4,color,"enum('white','black','brown','gray')",YES,,None,

In [40]:
query = """
select * from cats;
"""
get_query_result(query)

Query executed successfully and returned data.

   cat_id  name  age description color
0       1   tom    3        None  None
1       2  tom2    4        None  None
2       3  tom3    5        None  None